package ru.PageObjects;

/**
 * Класс для работы с главной страницей Яндекса (https://yandex.ru/).
 * Created by Vladimir V. Klochkov on 04.08.2018.
 * Updated by Vladimir V. Klochkov on 04.08.2018.
 */
public class YandexMainPage
{
    /*******************************************************************************************************************
     * Локаторы элементов страницы.
     ******************************************************************************************************************/

    /*******************************************************************************************************************
     * Методы страницы.
     ******************************************************************************************************************/
    public YandexMainPage openYandexMainPage(String url)
    {
        return this;
    }
}
