package ru.StepDefinitions;


import cucumber.api.java.en.Given;

import static com.codeborne.selenide.Selenide.open;

/**
 * Класс описывающий шаги теста по поиску электричек с помощью соответствующего сервиса Яндекса.
 * Created by Vladimir V. Klochkov on 04.08.2018.
 * Updated by Vladimir V. Klochkov on 04.08.2018.
 */
public class YandexTextSearchStepDefinitions
{
  /*******************************************************************************************************************
   * Поля класса.
   ******************************************************************************************************************/

  /*******************************************************************************************************************
   * Методы класса.
   ******************************************************************************************************************/
  @Given("^Пользователь открывает страницу \"([^\"]*)\"$")
  public void userOpensPageByUrl(String url)
  {
      open(url);
  }
}
